# St7SetVertexTMass1

Assigns a translational mass to the specified vertex as a single value.

long St7SetVertexTMass1(long uID, long VertexNum, double Mass)
Input Parameters
uID
Strand7 model file ID.
VertexNum
Vertex number.
Mass
The translational mass.